http-benchmarks/output/run-httpserv_effects-15000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 1.614ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.267ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.271ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.237ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.340ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.819ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.362ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.277ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.319ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.286ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.258ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.271ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.382ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.296ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.392ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.268ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.244ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.255ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.332ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.266ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.274ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.266ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.271ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms    1.40ms  15.76ms   95.27%
    Req/Sec   659.01    523.81     4.55k    84.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.43ms
 90.000%    1.97ms
 99.000%    9.30ms
 99.900%   12.80ms
 99.990%   14.52ms
 99.999%   15.22ms
100.000%   15.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.046     0.000000            1         1.00
       0.407     0.100000        74975         1.11
       0.596     0.200000       149374         1.25
       0.755     0.300000       224120         1.43
       0.898     0.400000       299214         1.67
       1.032     0.500000       373713         2.00
       1.098     0.550000       411265         2.22
       1.165     0.600000       448116         2.50
       1.242     0.650000       485750         2.86
       1.329     0.700000       522908         3.33
       1.431     0.750000       560159         4.00
       1.491     0.775000       579022         4.44
       1.557     0.800000       597583         5.00
       1.632     0.825000       616243         5.71
       1.720     0.850000       634850         6.67
       1.827     0.875000       653510         8.00
       1.894     0.887500       662869         8.89
       1.971     0.900000       672163        10.00
       2.067     0.912500       681558        11.43
       2.191     0.925000       690968        13.33
       2.361     0.937500       700217        16.00
       2.475     0.943750       704871        17.78
       2.619     0.950000       709497        20.00
       2.833     0.956250       714195        22.86
       3.197     0.962500       718840        26.67
       4.073     0.968750       723497        32.00
       4.735     0.971875       725843        35.56
       5.435     0.975000       728167        40.00
       6.179     0.978125       730505        45.71
       6.951     0.981250       732841        53.33
       7.775     0.984375       735163        64.00
       8.199     0.985938       736338        71.11
       8.615     0.987500       737497        80.00
       9.039     0.989062       738675        91.43
       9.455     0.990625       739840       106.67
       9.911     0.992188       741004       128.00
      10.127     0.992969       741585       142.22
      10.351     0.993750       742178       160.00
      10.567     0.994531       742749       182.86
      10.839     0.995313       743348       213.33
      11.119     0.996094       743929       256.00
      11.271     0.996484       744223       284.44
      11.423     0.996875       744506       320.00
      11.607     0.997266       744795       365.71
      11.847     0.997656       745085       426.67
      12.103     0.998047       745377       512.00
      12.247     0.998242       745522       568.89
      12.383     0.998437       745669       640.00
      12.511     0.998633       745812       731.43
      12.647     0.998828       745963       853.33
      12.823     0.999023       746107      1024.00
      12.951     0.999121       746176      1137.78
      13.087     0.999219       746255      1280.00
      13.199     0.999316       746323      1462.86
      13.335     0.999414       746397      1706.67
      13.495     0.999512       746469      2048.00
      13.583     0.999561       746504      2275.56
      13.687     0.999609       746544      2560.00
      13.799     0.999658       746579      2925.71
      13.911     0.999707       746614      3413.33
      14.015     0.999756       746650      4096.00
      14.071     0.999780       746669      4551.11
      14.127     0.999805       746690      5120.00
      14.199     0.999829       746707      5851.43
      14.311     0.999854       746724      6826.67
      14.447     0.999878       746741      8192.00
      14.487     0.999890       746750      9102.22
      14.567     0.999902       746761     10240.00
      14.631     0.999915       746770     11702.86
      14.743     0.999927       746779     13653.33
      14.831     0.999939       746787     16384.00
      14.879     0.999945       746791     18204.44
      14.911     0.999951       746797     20480.00
      14.959     0.999957       746801     23405.71
      15.023     0.999963       746806     27306.67
      15.071     0.999969       746810     32768.00
      15.095     0.999973       746814     36408.89
      15.095     0.999976       746814     40960.00
      15.159     0.999979       746817     46811.43
      15.183     0.999982       746819     54613.33
      15.191     0.999985       746821     65536.00
      15.207     0.999986       746822     72817.78
      15.215     0.999988       746823     81920.00
      15.223     0.999989       746826     93622.86
      15.223     0.999991       746826    109226.67
      15.247     0.999992       746827    131072.00
      15.247     0.999993       746827    145635.56
      15.471     0.999994       746828    163840.00
      15.495     0.999995       746829    187245.71
      15.495     0.999995       746829    218453.33
      15.663     0.999996       746830    262144.00
      15.663     0.999997       746830    291271.11
      15.663     0.999997       746830    327680.00
      15.759     0.999997       746831    374491.43
      15.759     0.999998       746831    436906.67
      15.759     0.999998       746831    524288.00
      15.759     0.999998       746831    582542.22
      15.759     0.999998       746831    655360.00
      15.767     0.999999       746832    748982.86
      15.767     1.000000       746832          inf
#[Mean    =        1.294, StdDeviation   =        1.403]
#[Max     =       15.760, Total count    =       746832]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  897753 requests in 1.00m, 1.83GB read
Requests/sec:  14951.56
Transfer/sec:     31.23MB

JSON Output:
{
	"requests": 897753,
	"duration_in_microseconds": 60044112.00,
	"bytes": 1966079070,
	"requests_per_sec": 14951.56,
	"bytes_transfer_per_sec": 32743911.18,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1032
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 1431
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 1971
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 9295
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 12799
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 14519
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 15223
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 15767
		}
	]
}